content/posts/learning_elm.md
+++
title = "Learning Elm"
author = ["João Gutemberg Farias"]
draft = false
+++

Material for learning [Elm]({{< relref "elm" >}}).

Good sources:

-   [ ] <https://guide.elm-lang.org/>
-   [ ] <https://github.com/dwyl/learn-elm>
-   [ ] <https://github.com/dwyl/learn-elm-architecture-in-javascript>
-   [X] <https://terezka.github.io/line-charts/>
-   [ ] <https://github.com/elm/svg>
-   [ ] <https://github.com/johnpmayer/elm-webgl>
-   [X] <https://youtu.be/x1FU3e0sT1I> ("Make Data Structures" by Richard Feldman)
-   [ ] <https://github.com/evancz/elm-todomvc>
-   [ ] <https://github.com/sporto/awesome-elm>

Seria bom depois ver como funciona o [Hot Swapping (Elm)]({{< relref "hot_swapping_elm" >}}) em Elm.
[Html to Elm (Elm)]({{< relref "html_to_elm_elm" >}})

Dois pacotes importantes que eu vou usar [elm-charts]({{< relref "elm_charts" >}}) e [GraphicSVG]({{< relref "graphicsvg" >}})
Além de [elm-spa]({{< relref "elm_spa" >}})

Muito importante sobre otimização de funções recursivas
<https://jfmengels.net/tail-call-optimization/>

Para fazer gráficos eu tenho várias opções como [GraphicSVG]({{< relref "graphicsvg" >}}), [elm-playground]({{< relref "elm_playground" >}}), [typed-svg]({{< relref "typed_svg_elm" >}}) e [elm-geometry]({{< relref "elm_geometry" >}})

Ainda tem o elm-particle que pode fazer a agua saindo do nivel


## Coisas a perguntar ao criador do elm-geometry {#coisas-a-perguntar-ao-criador-do-elm-geometry}

-   Se a biblioteca elm-geometry-svg consegue gerar um svg a partir de uma vista de algo em 3d
-   Se tem alguma alternativa pra fazer gráficos de dados em 3d (3d data plot)
-   Eu vi que você falou em CAD e achei muito legal sua iniciativa pq odeio desenhar em cad mas adoro programar. Pra mim faria muito sentido ter um programa de CAD que funcionasse por meio de um script ou algo híbrido.
